Tekla Open API Reference for Tekla Structures 2025
RebarItem.Modify Method
 Modifies the rebar item in the rebar database based on the given parameters.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Modify(
	string OriginalGrade,
	string OriginalSize,
	string OriginalUsage
)
Public Function Modify (
	OriginalGrade As String,
	OriginalSize As String,
	OriginalUsage As String
) As Boolean
Parameters
OriginalGrade
Type: System.String
Original Grade
OriginalSize
Type: System.String
Original Size
OriginalUsage
Type: System.String
Original Usage
Return Value
Type: Boolean
True on success
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace